In [4]:
import pandas as pd

In [ ]:
"""Pandas is used to analyse data"""

In [5]:
df = pd.read_csv("name.csv")

In [13]:
df

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef

In [11]:
"""
By de fault panda consider first row as first coloum
to neglect that head = None is used
"""

pd.read_csv("name.csv" , header=None)

    0               1    2          3           4
0  ID            Name  Age    Country  Occupation
1   1        John Doe   28        USA    Engineer
2   2      Jane Smith   34     Canada      Doctor
3   3       Sam Brown   22         UK     Student
4   4     Emily Davis   45  Australia     Teacher
5   5  Michael Wilson   30        USA    Designer
6   6  Sophia Johnson   27    Germany   Architect
7   7     Liam Martin   31     France        Chef

In [10]:
"""Helps to skip 2 rows from top"""

pd.read_csv("name.csv" , skiprows=2)

   2      Jane Smith  34     Canada     Doctor
0  3       Sam Brown  22         UK    Student
1  4     Emily Davis  45  Australia    Teacher
2  5  Michael Wilson  30        USA   Designer
3  6  Sophia Johnson  27    Germany  Architect
4  7     Liam Martin  31     France       Chef

In [16]:
pd.read_csv("name.csv" , usecols=['Name', 'Age'])

             Name  Age
0        John Doe   28
1      Jane Smith   34
2       Sam Brown   22
3     Emily Davis   45
4  Michael Wilson   30
5  Sophia Johnson   27
6     Liam Martin   31

In [17]:
df

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef

In [ ]:
#In pasdas we store data in form series and data form
#series is one dimentional in nature and data frame is 2
#dimentional in nature

In [18]:
type(df)

pandas.core.frame.DataFrame

In [20]:
#We can access any coloum by name of the coloum
df.Name

0          John Doe
1        Jane Smith
2         Sam Brown
3       Emily Davis
4    Michael Wilson
5    Sophia Johnson
6       Liam Martin
Name: Name, dtype: object

In [21]:
"""Another way to declare method"""

df["Name"]

0          John Doe
1        Jane Smith
2         Sam Brown
3       Emily Davis
4    Michael Wilson
5    Sophia Johnson
6       Liam Martin
Name: Name, dtype: object

In [22]:
type(df["Name"]) # A coloum is a series in data frame

pandas.core.series.Series

In [7]:
l = [1 , 2 , 3 , 4]
s = pd.Series(l)

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s #Index will be there

0    1
1    2
2    3
3    4
dtype: int64

In [28]:
s[0:]

0    1
1    2
2    3
3    4
dtype: int64

In [30]:
print(s[1])

2

In [10]:
#By default index are interger
#We can have custom indexex

d = pd.Series([100 , 200 , 300] , index = [2.3 , 4.5 , 1])

In [32]:
d

2.3    100
4.5    200
1.0    300
dtype: int64

In [35]:
print(d[2.3])

100

In [36]:
type(d)

pandas.core.series.Series

In [11]:
#To see the all index of series
d.index

Index([2.3, 4.5, 1.0], dtype='float64')

In [14]:
#To reset index

d.reset_index(drop=True)

0    100
1    200
2    300
dtype: int64

In [15]:
d.reset_index(drop=False)

   index    0
0    2.3  100
1    4.5  200
2    1.0  300

In [16]:
d

2.3    100
4.5    200
1.0    300
dtype: int64

In [17]:
pd.DataFrame(d)

       0
2.3  100
4.5  200
1.0  300

In [18]:
df

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef

In [19]:
#I want first 5 rows

df.head(5)

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer

In [20]:
df.head(2)

   ID        Name  Age Country Occupation
0   1    John Doe   28     USA   Engineer
1   2  Jane Smith   34  Canada     Doctor

In [21]:
df.tail(2)

   ID            Name  Age  Country Occupation
5   6  Sophia Johnson   27  Germany  Architect
6   7     Liam Martin   31   France       Chef

In [22]:
df.shape #How many row and coloum are there

(7, 5)

In [23]:
df.columns

Index(['ID', 'Name', 'Age', 'Country', 'Occupation'], dtype='object')

In [24]:
list(df.columns)

['ID', 'Name', 'Age', 'Country', 'Occupation']

In [25]:
df.sample(2) #Gives 2 random rows

   ID            Name  Age  Country Occupation
5   6  Sophia Johnson   27  Germany  Architect
6   7     Liam Martin   31   France       Chef

In [6]:
df.info

<bound method DataFrame.info of    ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef>

In [27]:
df.dtypes

ID             int64
Name          object
Age            int64
Country       object
Occupation    object
dtype: object

In [ ]:
d

2.3    100
4.5    200
1.0    300
dtype: int64

In [29]:
d["new coloum"] = "Rupam"

In [30]:
d

2.3             100
4.5             200
1.0             300
new coloum    Rupam
dtype: object

In [31]:
pd.DataFrame(d)

                0
2.3           100
4.5           200
1.0           300
new coloum  Rupam

In [32]:
d["new-coloum"] = "Rupam"

In [33]:
d

2.3             100
4.5             200
1.0             300
new coloum    Rupam
new-coloum    Rupam
dtype: object

In [34]:
df

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef

In [35]:
df["new-col"] = "Rupam"

In [37]:
df

   ID            Name  Age    Country Occupation new-col
0   1        John Doe   28        USA   Engineer   Rupam
1   2      Jane Smith   34     Canada     Doctor   Rupam
2   3       Sam Brown   22         UK    Student   Rupam
3   4     Emily Davis   45  Australia    Teacher   Rupam
4   5  Michael Wilson   30        USA   Designer   Rupam
5   6  Sophia Johnson   27    Germany  Architect   Rupam
6   7     Liam Martin   31     France       Chef   Rupam

In [39]:
df[["Name" , "Age"]] #we can access two simultaneously you have to give 2 brakets

             Name  Age
0        John Doe   28
1      Jane Smith   34
2       Sam Brown   22
3     Emily Davis   45
4  Michael Wilson   30
5  Sophia Johnson   27
6     Liam Martin   31

In [9]:
pd.read_excel("data.xlsx")

   ID            Name  Age    Country Occupation
0   1        John Doe   28        USA   Engineer
1   2      Jane Smith   34     Canada     Doctor
2   3       Sam Brown   22         UK    Student
3   4     Emily Davis   45  Australia    Teacher
4   5  Michael Wilson   30        USA   Designer
5   6  Sophia Johnson   27    Germany  Architect
6   7     Liam Martin   31     France       Chef